{
  "2023": [
    {
      "title": "7 Emerging Aerospace Technology Trends to Know About in 2023",
      "description": "The aerospace industry is constantly evolving. New technology posed to disrupt the world is continuously in development. Many of these are very early in their development. We may not see their results for decades to come.",
      "url": "https://astforgetech.com/7-emerging-aerospace-technology-trends-to-know-about-in-2023/"
    },
    {
      "title": "NASA Details Top Stories for 2023",
      "description": "In 2023, as NASA pushed the limits of exploration for the benefit of humanity, the agency celebrated astronaut Frank Rubio becoming the first American astronaut to spend more than one year in space; delivered samples from an asteroid to Earth; sent a spacecraft to study a metal-rich asteroid for the first time; launched multiple initiatives to share climate data; advanced developments in sustainable aircraft; all while continuing preparations to send the first Artemis astronauts to the Moon.",
      "url": "https://www.nasa.gov/nasas-2023-year-in-review/"
    },
    {
      "title": "NASA’s EZIE Launching to Study Magnetic Fingerprints of Earth’s Aurora",
      "description": "High above Earth’s poles, intense electrical currents called electrojets flow through the upper atmosphere when auroras glow in the sky. These auroral electrojets push about a million amps of electrical charge around the poles every second. They can create some… ",
      "url": "https://science.nasa.gov/science-research/heliophysics/nasas-ezie-launching-to-study-magnetic-fingerprints-of-earths-aurora/"
    },
    {
      "title": "The Atmosphere… After Dark!",
      "description": "Discover the wonders of the night sky! Learn how Earth's atmosphere transforms after dark, setting the stage for breathtaking phenomena like auroras, meteors, solar terminator waves, and sprites.",
      "url": "https://science.nasa.gov/sun/the-atmosphere-after-dark/"
    },
    {
      "title": "NASA Technologies Receive Multiple Nods in TIME Inventions of 2023",
      "description": "As NASA explores, innovates, and inspires through its work, agency inventions aimed at monitoring atmospheric pollution, studying samples from asteroids, extracting oxygen from the Martian atmosphere, and revolutionizing flight have been named TIME’s Inventions of 2023. TIME announced the honorees on Oct. 24.",
      "url": "https://www.nasa.gov/general/nasa-technologies-receive-multiple-nods-in-time-inventions-of-2023/"
    }
  ]
}
