{
  "2024": [
    {
      "title": "Space Technology - January 2024",
      "description": "The January 2024 Special Report on Space Technology presents a comprehensive overview of the latest advancements and innovations in the field of space exploration and satellite technology. This edition highlights several key developments that are shaping the future of space missions and satellite operations.",
      "url": "https://www.techbriefs.com/component/content/article/50192-doc-9257"
    },
    {
      "title": "Accelerating a New ERA in Space: Efficiency, Reliability and Autonomy",
      "description": "Efficiency, reliability, autonomy – three words that are of tremendous importance in 2024’s space industry. Having continuous access to funding and investment, a talented workforce, and reliable materials, components and parts, is imperative for successful missions and to retain a strong, sovereign position in space.",
      "url": "https://www.spacetechexpo.com/industry-insights/blogs/accelerating-a-new-era-in-space-efficiency-reliability-and-autonomy/"
    },
    {
      "title": "State-of-the-Art Small Spacecraft Technology Report is Released",
      "description": "NASA’s Small Spacecraft Systems Virtual Institute (S3VI) is pleased to announce the official release of the highly anticipated 2024 State-of-the-Art Small Spacecraft Technology report. This significant accomplishment was made possible by the contributions of numerous dedicated people across NASA who graciously supported the preparation of the document as authors and reviewers. ",
      "url": "https://www.nasa.gov/general/2024-state-of-the-art-small-spacecraft-technology-report-is-released/"
    },
    {
      "title": "Space Tech Companies Emerging from Stealth in 2024",
      "description": "The space tech industry is experiencing a surge of innovation and investment with at least 13 companies emerging from stealth mode since 2023. Collectively, these companies have raised almost $300 million in funding, driving major expansion and technological advancements across the sector.",
      "url": "https://spaceinsider.tech/2024/05/24/space-tech-companies-emerging-from-stealth-in-2024/"
    },
    {
      "title": "Capella Space Wraps Up 2024: A Year of Momentum",
      "description": "2024 has been a defining year for Capella Space. From groundbreaking advancements in SAR technology to new partnerships and capabilities, we’ve achieved significant milestones that solidify our role as leaders in Earth observation. Together with our customers, partners, and an incredible team, we’re proud to share the highlights from this transformative year and a glimpse into what’s next.",
      "url": "https://www.capellaspace.com/blog/capella-space-wraps-up-2024"
    }
  ]
}
