{
  "2025": [
    {
      "title": "NASA Draws Closer to Artemis II ",
      "description": "NASA integrated the Artemis II Orion stage adapter with the rest of the SLS (Space Launch System) rocket on Wednesday in the Vehicle Assembly Building at the agency’s  Kennedy Space Center in Florida.",
      "url": "https://www.nasa.gov/blogs/missions/2025/09/30/nasa-draws-closer-to-artemis-ii-rocket-completion-with-newest-addition/"
    },
    {
      "title": "Astrobee Robotics Platform Goes Commercial",
      "description": "NASA’s free-flying Astrobee robot aboard the ISS is transitioning into commercial operations through Arkisys Inc. The move will expand private-sector access to zero-gravity robotics research, with new experiments in space autonomy and docking systems",
      "url": "https://viterbischool.usc.edu/news/2025/10/space-robotics-platform-astrobee-set-for-commercial-transition-for-iss-operations/"
    },
    {
      "title": "SpaceX launched its 10,000th satellite to orbit",
      "description": "SpaceX has lofted 9,988 Starlink satellites to date, according to astrophysicist and satellite tracker Jonathan McDowell. So today's launch will take that number above 10,000. It will also be the record-breaking 31st liftoff for this Falcon 9's first stage.",
      "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-10000th-starlink-satellite-launch"
    },
    {
      "title": "Constraints On Solar Power Satellites Are More Ground-Based Than Space-Based",
      "description": "Space-based solar power has been gaining more and more traction recently. The recent success of Caltech’s Space Solar Power Project, which demonstrated the feasibility of transmitting power from space to the ground, has been matched by a number of pilot projects throughout the world",
      "url": "https://www.universetoday.com/articles/constraints-on-solar-power-satellites-are-more-ground-based-than-space-based"
    },
    {
      "title": "Hubble spies a glowing 'starburst ring",
      "description": "Crossing the core of NGC 6951 is a bar of stars, a common feature in elongated spiral galaxies that acts as a kind of galactic conveyor belt, channeling gas inward toward the nucleus That flow of gas gives rise to one of the galaxy's most captivating features: a circumnuclear starburst ring about 3,800 light years wide that encircles the galactic heart.",
      "url": "https://www.space.com/astronomy/hubble-space-telescope/hubble-spies-a-glowing-starburst-ring-space-photo-of-the-day-for-oct-20-2025"
    },
    {
      "title": "Saturn’s rings are weird and wonderful: 10 facts here",
      "description": "Saturn’s rings have given this planet the nickname the jewel of the solar system. At times when small telescopes don’t show the rings – when they’re edgewise to us, as they were for a few weeks last March – Saturn appears as a golden ball, just another distant gas giant world.",
      "url": "https://earthsky.org/space/saturns-rings-10-weird-facts/"
    }
    ,{
      "title": "Signs of Late-Stage Cryovolcanism in Pluto’s Hayabusa Terra",
      "description": "What can cryovolcanism on Pluto teach scientists about the dwarf planet’s current geological activity? This is what a recent study published in *The Planetary Science Journal* hopes to address as a team of researchers investigated potential cryovolcanic sites within specific regions on Pluto.",
      "url": "https://www.universetoday.com/articles/signs-of-late-stage-cryovolcanism-in-plutos-hayabusa-terra"
    }
    ,
    {
      "title": "Within Mars’ Craters, Ice Deposits Have Recorded the History of the Planet",
      "description": "On the surface of Mars, there are numerous features that tell of a past age when the planet was warmer and wetter, with rivers, lakes, and even an ocean that covered much of its northern hemisphere. These include river channels, delta fans, sedimentary deposits, and low-lying regions rich in clay minerals.",
      "url": "https://www.universetoday.com/articles/within-mars-craters-ice-deposits-have-recorded-the-history-of-the-planet"
    },
    {
      "title": "Comet Halley is the parent of 2 meteor showers",
      "description": "The famous Halley’s Comet is the parent of 2 annual meteor showers: the Eta Aquariids in May and the Orionids in October. We witness these showers when we cross the comet’s orbit. But if we cross the orbit of Comet Halley twice each year, does that means there’s a chance that Earth and the comet will collide?",
      "url": "https://earthsky.org/astronomy-essentials/comet-halley-parent-of-2-meteor-showers/"
    },
    {
      "title": "Earth’s magnetic field has a weak spot that’s growing",
      "description": "Earth’s magnetic field is like a giant protective bubble around our planet. It’s generated by the churning of molten metal in Earth’s liquid outer core. And it extends from the core out into space, where it fends off charged particles from the solar wind. But the strength of the magnetic field is not the same everywhere on Earth.",
      "url": "https://earthsky.org/earth/earths-magnetic-field-weak-spot-growing/"
    }
  ]
}
